gnarpool_backend/app/controllers/drivers_controller.rb

SELECT "drivers".* FROM "drivers" WHERE "drivers"."resort" = ?  [["resort", "Loveland"]]
SELECT "drivers".* FROM "drivers"
---
  def index #GET / Drivers

    if params[:resort]
      @drivers = Driver.where(resort: params[:resort])
      render json: @drivers

    elsif params[:pass]
      @drivers = Driver.where(pass: params[:pass])
      render json: @drivers

    elsif params[:datetime]
      @drivers = Driver.where(datetime: params[:datetime])
      render json: @drivers

    else
      @drivers = Driver.all

SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show #GET /Drivers/:id
    @driver = Driver.find(params[:id])

INSERT INTO "drivers" ("name", "phone", "email", "resort", "pass", "Venmo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @driver = Driver.create(
      name: params[:name],
      phone: params[:phone],
      email: params[:email],
      datetime: params[:datetime],
      resort: params[:resort],
      pass: params[:pass],
      Venmo: params[:Venmo],
      )