gnarpool_backend/app/controllers/rides_controller.rb

SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "riders".* FROM "riders" WHERE "riders"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
INSERT INTO "rides" ("driver_id", "rider_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["driver_id", 11], ["rider_id", 11], ["created_at", "2020-06-22 23:25:15.997171"], ["updated_at", "2020-06-22 23:25:15.997171"]]
---
  def create #POST /ride
    @driver = Driver.find(params[:driver_id].to_i)
    @rider = Rider.find(params[:rider_id].to_i)

    @ride = Ride.create(rider: @rider, driver: @driver)