gnarpool_backend/app/controllers/riders_controller.rb

SELECT "riders".* FROM "riders" WHERE "riders"."resort" = ?  [["resort", "Loveland"]]
SELECT "riders".* FROM "riders" WHERE "riders"."pass" = ?  [["pass", "Epic"]]
SELECT "riders".* FROM "riders"
---
  def index #GET / riders
    if params[:resort]
      @riders = Rider.where(resort: params[:resort])
      render json: @riders

    elsif params[:pass]
      @riders = Rider.where(pass: params[:pass])
      render json: @riders

    elsif params[:datetime]
      @riders = Rider.where(datetime: params[:datetime])
      render json: @riders
    else
      @riders = Rider.all

SELECT "riders".* FROM "riders" WHERE "riders"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def show #GET /riders/:id
    @rider = Rider.find(params[:id])

INSERT INTO "riders" ("name", "phone", "email", "resort", "pass", "Venmo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create #POST / riders
    @rider = Rider.create(
        name: params[:name],
        phone: params[:phone],
        email: params[:email],
        datetime: params[:datetime],
        resort: params[:resort],
        pass: params[:pass],
        Venmo: params[:Venmo],
      )